Revit 2024 API
AreaCreationData Class
 A class which wraps the arguments of Area for batch creation
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class AreaCreationData
Visual Basic
Public Class AreaCreationData
Visual C++
public ref class AreaCreationData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Creation.AreaCreationData
See Also
AreaCreationData Members
Autodesk.Revit.Creation Namespace